
WQTrackerDB = {
	["profileKeys"] = {
		["孤影丶殘刀 - 死亡之翼"] = "Default",
		["浀終何苾亽潵 - 范达尔鹿盔"] = "Default",
		["初吻给了奶嘴 - 范达尔鹿盔"] = "Default",
		["提壺笑蒼生 - 死亡之翼"] = "Default",
		["称霸幼儿园 - 范达尔鹿盔"] = "Default",
		["擺攤灬賣記憶 - 范达尔鹿盔"] = "Default",
		["人丑脾气大 - 死亡之翼"] = "Default",
		["半城丶烟沙 - 范达尔鹿盔"] = "Default",
		["備受聯盟關註 - 死亡之翼"] = "Default",
		["墜落愛情 - 范达尔鹿盔"] = "Default",
	},
	["profiles"] = {
		["Default"] = {
			["map_frame_anchor"] = "left",
			["zone_map_config"] = {
				["scale"] = 1.5,
			},
			["hoverover_animations"] = false,
			["show_faction_frame"] = false,
			["show_yards_distance"] = false,
			["TutorialTaxyMap"] = true,
			["use_quest_summary"] = false,
			["TutorialTracker"] = 2,
			["groupfinder"] = {
				["askleave_delayed"] = false,
				["leavetimer"] = 60,
				["dont_open_in_group"] = false,
				["enabled"] = false,
				["noleave"] = true,
			},
			["bar_anchor"] = "top",
			["world_map_config"] = {
				["summary_scale"] = 1.5,
			},
			["TutorialPopupID"] = 5,
			["tracker_show_time"] = true,
			["show_timeleft"] = true,
			["sort_order"] = {
				["equipment"] = 3,
				["profession"] = 5,
				["dungeon"] = 2,
				["pvp"] = 4,
			},
			["is_BFA_version"] = true,
			["tracker_textsize"] = 14,
			["anchor_options"] = {
				[942] = {
					["Enabled"] = true,
					["TextColor"] = {
						1, -- [1]
						0.8, -- [2]
						0.2, -- [3]
						0.854, -- [4]
					},
					["ScaleOffset"] = 0,
					["Alpha"] = 1,
					["YOffset"] = 0,
				},
				[896] = {
					["Enabled"] = true,
					["TextColor"] = {
						1, -- [1]
						0.8, -- [2]
						0.2, -- [3]
						0.854, -- [4]
					},
					["ScaleOffset"] = 0,
					["Alpha"] = 1,
					["YOffset"] = 0,
				},
				[863] = {
					["Enabled"] = true,
					["TextColor"] = {
						1, -- [1]
						0.8, -- [2]
						0.2, -- [3]
						0.854, -- [4]
					},
					["ScaleOffset"] = 0,
					["Alpha"] = 1,
					["YOffset"] = 0,
				},
				[1161] = {
					["Enabled"] = true,
					["TextColor"] = {
						1, -- [1]
						0.8, -- [2]
						0.2, -- [3]
						0.854, -- [4]
					},
					["ScaleOffset"] = 0,
					["Alpha"] = 1,
					["YOffset"] = 0,
				},
				[895] = {
					["Enabled"] = true,
					["TextColor"] = {
						1, -- [1]
						0.8, -- [2]
						0.2, -- [3]
						0.854, -- [4]
					},
					["ScaleOffset"] = 0,
					["Alpha"] = 1,
					["YOffset"] = 0,
				},
				[862] = {
					["Enabled"] = true,
					["TextColor"] = {
						1, -- [1]
						0.8, -- [2]
						0.2, -- [3]
						0.854, -- [4]
					},
					["ScaleOffset"] = 0,
					["Alpha"] = 1,
					["YOffset"] = 0,
				},
				[864] = {
					["Enabled"] = true,
					["TextColor"] = {
						1, -- [1]
						0.8, -- [2]
						0.2, -- [3]
						0.854, -- [4]
					},
					["ScaleOffset"] = 0,
					["Alpha"] = 1,
					["YOffset"] = 0,
				},
				[1165] = {
					["Enabled"] = true,
					["TextColor"] = {
						1, -- [1]
						0.8, -- [2]
						0.2, -- [3]
						0.854, -- [4]
					},
					["ScaleOffset"] = 0,
					["Alpha"] = 1,
					["YOffset"] = 0,
				},
			},
			["sound_enabled"] = false,
			["quests_tracked"] = {
				["Player-741-04564F38"] = {
				},
				["Player-1685-025A66BA"] = {
				},
				["Player-1685-0185B87A"] = {
				},
				["Player-1685-022AD477"] = {
				},
				["Player-1685-01869803"] = {
				},
				["Player-741-045AC619"] = {
				},
				["Player-741-046BCEF3"] = {
				},
				["Player-741-04B5ED8D"] = {
				},
				["Player-1685-0253862C"] = {
				},
				["Player-1685-0186F56E"] = {
				},
			},
			["quests_all_characters"] = {
				["Player-1685-0253862C"] = {
					[51620] = {
						["expireAt"] = 1553252545,
						["rewardAmount"] = 195,
						["rewardTexture"] = "Interface\\AddOns\\WorldQuestTracker\\media\\icon_artifact_power",
					},
					[51610] = {
						["expireAt"] = 1553252545,
						["rewardAmount"] = 307,
						["rewardTexture"] = "Interface\\AddOns\\WorldQuestTracker\\media\\icon_artifact_power",
					},
					[51778] = {
						["expireAt"] = 1553252545,
						["rewardAmount"] = 169,
						["rewardTexture"] = "Interface\\AddOns\\WorldQuestTracker\\media\\icon_artifact_power",
					},
				},
				["Player-741-04564F38"] = {
				},
			},
			["player_names"] = {
				["Player-741-04564F38"] = {
					["class"] = "DEATHKNIGHT",
					["name"] = "孤影丶殘刀",
					["realm"] = "死亡之翼",
				},
				["Player-1685-025A66BA"] = {
					["class"] = "PRIEST",
					["name"] = "初吻给了奶嘴",
					["realm"] = "范达尔鹿盔",
				},
				["Player-1685-0185B87A"] = {
					["class"] = "MAGE",
					["name"] = "墜落愛情",
					["realm"] = "范达尔鹿盔",
				},
				["Player-1685-022AD477"] = {
					["class"] = "DEMONHUNTER",
					["name"] = "半城丶烟沙",
					["realm"] = "范达尔鹿盔",
				},
				["Player-1685-01869803"] = {
					["class"] = "DRUID",
					["name"] = "擺攤灬賣記憶",
					["realm"] = "范达尔鹿盔",
				},
				["Player-741-045AC619"] = {
					["class"] = "PALADIN",
					["name"] = "備受聯盟關註",
					["realm"] = "死亡之翼",
				},
				["Player-741-046BCEF3"] = {
					["class"] = "MONK",
					["name"] = "提壺笑蒼生",
					["realm"] = "死亡之翼",
				},
				["Player-741-04B5ED8D"] = {
					["class"] = "WARLOCK",
					["name"] = "人丑脾气大",
					["realm"] = "死亡之翼",
				},
				["Player-1685-0253862C"] = {
					["class"] = "WARRIOR",
					["name"] = "称霸幼儿园",
					["realm"] = "范达尔鹿盔",
				},
				["Player-1685-0186F56E"] = {
					["class"] = "HUNTER",
					["name"] = "浀終何苾亽潵",
					["realm"] = "范达尔鹿盔",
				},
			},
			["rarescan"] = {
				["recently_spotted"] = {
					[141616] = {
						1553209763, -- [1]
						14, -- [2]
						0.523882627487183, -- [3]
						0.578716635704041, -- [4]
						"Creature-0-0000-0000-00000-141616-0000000000", -- [5]
						"雷霆巨怪", -- [6]
						"称霸幼儿园", -- [7]
						1553209691, -- [8]
					},
					[142435] = {
						1553209901, -- [1]
						14, -- [2]
						0.37855738401413, -- [3]
						0.716354012489319, -- [4]
						"Creature-0-0000-0000-00000-142435-0000000000", -- [5]
						"瘟疫之羽", -- [6]
						"称霸幼儿园", -- [7]
						1553209829, -- [8]
					},
				},
				["recently_killed"] = {
					["Player-1685-0253862C"] = {
					},
				},
				["show_icons"] = false,
				["search_group"] = false,
				["always_use_english"] = false,
				["playsound_volume"] = 1,
				["name_cache"] = {
					[""] = 122999,
					["愤怒领主亚雷兹"] = 126338,
					["乌布拉金"] = 122004,
					["监视者艾瓦"] = 127291,
					["约古萨"] = 142440,
					["瓦加"] = 126208,
					["毒尾天鳍鳐"] = 126867,
					["法鲁克队长"] = 126869,
					["轰鸣的土元素"] = 141620,
					["攻城大师沃兰"] = 120393,
					["雷霆巨怪"] = 141616,
					["加尔佐斯"] = 122999,
					["首席炼金师蒙库鲁斯"] = 127376,
					["狂怒之喙"] = 142436,
					["啮颅者"] = 142437,
					["监工克里克斯"] = 142423,
					["枝条领主奥德鲁斯"] = 142508,
					["潮涌巨怪"] = 141618,
					["瘟疫之羽"] = 142435,
					["萨卡尔中尉"] = 126254,
					["维诺马鲁斯"] = 142438,
					["燃烧巨怪"] = 141615,
					["沙布尔"] = 126898,
					["阿塔克松"] = 126887,
					["密斯莱尔的回响"] = 141668,
					["苍白的卡拉"] = 126860,
					["驯犬大师克拉克斯"] = 127288,
					["鬼母拉格拉丝"] = 125820,
					["全知者萨纳里安"] = 127096,
					["碎骨者穆罗克"] = 141942,
					["女巫苏薇西娅"] = 123464,
				},
				["use_master"] = false,
			},
			["filters"] = {
				["pet_battles"] = false,
				["equipment"] = false,
				["dungeon"] = false,
			},
			["history"] = {
				["quest"] = {
					["global"] = {
						[54822] = 1,
						[54826] = 2,
						[54830] = 1,
						[54838] = 2,
						[53699] = 1,
						[54600] = 1,
						[54858] = 3,
						[54608] = 1,
						[54620] = 1,
						[54624] = 3,
						[51461] = 1,
						[52862] = 2,
						[54017] = 1,
						[54533] = 1,
						[54668] = 4,
						[54680] = 1,
						[54565] = 2,
						[54569] = 1,
						[54827] = 1,
						[51656] = 1,
						[53323] = 1,
						[54597] = 1,
						[53712] = 1,
						[53724] = 1,
						[54621] = 2,
						[54625] = 3,
						[53867] = 1,
						[53768] = 1,
						[54665] = 1,
						[55304] = 1,
						[53784] = 1,
						[51887] = 1,
						[54816] = 1,
						[54566] = 2,
						[54570] = 1,
						[53812] = 1,
						[55340] = 1,
						[54836] = 2,
						[54840] = 1,
						[51669] = 1,
						[54471] = 1,
						[53717] = 1,
						[51566] = 1,
						[54622] = 3,
						[54507] = 1,
						[54511] = 1,
						[54515] = 1,
						["total"] = 115,
						[54662] = 1,
						[55301] = 1,
						[54564] = 1,
						[54674] = 2,
						[51699] = 1,
						[52847] = 1,
						[51311] = 1,
						[54563] = 1,
						[54821] = 1,
						[54571] = 1,
						[53979] = 1,
						[54573] = 2,
						[54837] = 2,
						[54540] = 2,
						[53312] = 1,
						[53706] = 2,
						[54831] = 1,
						[54857] = 1,
						[54691] = 1,
						[54578] = 1,
						[54647] = 1,
						[53857] = 1,
						[54623] = 2,
						[54500] = 1,
						[52869] = 1,
						[54669] = 1,
						[53877] = 1,
						[54825] = 1,
						[54266] = 1,
						[54524] = 1,
						[54020] = 1,
						[51611] = 1,
						[54572] = 1,
						[54667] = 1,
						[54604] = 3,
						[52475] = 1,
						[54298] = 1,
						[51064] = 1,
						[50767] = 1,
						[54818] = 2,
						[51632] = 1,
					},
					["character"] = {
						["Player-1685-0253862C"] = {
							[54822] = 1,
							[54826] = 2,
							[54830] = 1,
							[54838] = 2,
							[53699] = 1,
							[54600] = 1,
							[54858] = 3,
							[54608] = 1,
							[54620] = 1,
							[54624] = 3,
							[51461] = 1,
							[52862] = 2,
							[54017] = 1,
							[54533] = 1,
							[54668] = 4,
							[54680] = 1,
							[54565] = 2,
							[54569] = 1,
							[54827] = 1,
							[51656] = 1,
							[53323] = 1,
							[54597] = 1,
							[53712] = 1,
							[53724] = 1,
							[54621] = 2,
							[54625] = 3,
							[53867] = 1,
							[53768] = 1,
							[54665] = 1,
							[55304] = 1,
							[53784] = 1,
							[51887] = 1,
							[54816] = 1,
							[54566] = 2,
							[54570] = 1,
							[53812] = 1,
							[55340] = 1,
							[54836] = 2,
							[54840] = 1,
							[51669] = 1,
							[54471] = 1,
							[53717] = 1,
							[51566] = 1,
							[54622] = 3,
							[54507] = 1,
							[54511] = 1,
							[54515] = 1,
							["total"] = 115,
							[54662] = 1,
							[55301] = 1,
							[54564] = 1,
							[54674] = 2,
							[51699] = 1,
							[52847] = 1,
							[51311] = 1,
							[54563] = 1,
							[54821] = 1,
							[54571] = 1,
							[53979] = 1,
							[54573] = 2,
							[54837] = 2,
							[54540] = 2,
							[53312] = 1,
							[53706] = 2,
							[54831] = 1,
							[54857] = 1,
							[54691] = 1,
							[54578] = 1,
							[54647] = 1,
							[53857] = 1,
							[54623] = 2,
							[54500] = 1,
							[52869] = 1,
							[54669] = 1,
							[53877] = 1,
							[54825] = 1,
							[54266] = 1,
							[54524] = 1,
							[54020] = 1,
							[51611] = 1,
							[54572] = 1,
							[54667] = 1,
							[54604] = 3,
							[52475] = 1,
							[54298] = 1,
							[51064] = 1,
							[50767] = 1,
							[54818] = 2,
							[51632] = 1,
						},
					},
				},
				["period"] = {
					["global"] = {
						["190321"] = {
							["quest"] = 4,
							["resource"] = 563,
							["gold"] = 1325400,
						},
						["190317"] = {
							["artifact"] = 281,
							["quest"] = 16,
							["resource"] = 2336,
							["gold"] = 6396100,
						},
						["190315"] = {
							["profession"] = {
								[152513] = 1,
							},
							["resource"] = 1717,
							["quest"] = 14,
							["gold"] = 6797600,
						},
						["190322"] = {
							["quest"] = 9,
							["resource"] = 817,
							["gold"] = 3897400,
						},
						["190316"] = {
							["resource"] = 1723,
							["quest"] = 17,
							["gold"] = 2576800,
						},
						["190319"] = {
							["artifact"] = 227,
							["resource"] = 2357,
							["quest"] = 14,
						},
						["190314"] = {
							["resource"] = 824,
							["quest"] = 5,
							["gold"] = 1336100,
						},
						["190320"] = {
							["resource"] = 1958,
							["quest"] = 18,
							["gold"] = 5165400,
						},
						["190318"] = {
							["quest"] = 18,
							["resource"] = 2418,
							["gold"] = 3326200,
						},
					},
					["character"] = {
						["Player-1685-0253862C"] = {
							["190321"] = {
								["quest"] = 4,
								["resource"] = 563,
								["gold"] = 1325400,
							},
							["190317"] = {
								["artifact"] = 281,
								["quest"] = 16,
								["resource"] = 2336,
								["gold"] = 6396100,
							},
							["190315"] = {
								["profession"] = {
									[152513] = 1,
								},
								["resource"] = 1717,
								["quest"] = 14,
								["gold"] = 6797600,
							},
							["190322"] = {
								["quest"] = 9,
								["resource"] = 817,
								["gold"] = 3897400,
							},
							["190316"] = {
								["resource"] = 1723,
								["quest"] = 17,
								["gold"] = 2576800,
							},
							["190319"] = {
								["artifact"] = 227,
								["resource"] = 2357,
								["quest"] = 14,
							},
							["190314"] = {
								["resource"] = 824,
								["quest"] = 5,
								["gold"] = 1336100,
							},
							["190320"] = {
								["resource"] = 1958,
								["quest"] = 18,
								["gold"] = 5165400,
							},
							["190318"] = {
								["quest"] = 18,
								["resource"] = 2418,
								["gold"] = 3326200,
							},
						},
					},
				},
				["reward"] = {
					["global"] = {
						["artifact"] = 508,
						["profession"] = {
							[152513] = 1,
						},
						["resource"] = 14713,
						["gold"] = 30821000,
					},
					["character"] = {
						["Player-1685-0253862C"] = {
							["artifact"] = 508,
							["profession"] = {
								[152513] = 1,
							},
							["resource"] = 14713,
							["gold"] = 30821000,
						},
					},
				},
			},
		},
	},
}
